Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: ཟང་ཟིང་མེད་པའི་ཆོས་ཀྱིས་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་ན། ཁ་ཅིག་ནི་དགྲ་བཅོམ་པ་ཉིད་ལ་འགོད། ཁ་ཅིག་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་ཁ་ཅིག་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ལ། ཁ་ཅིག་ནི་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ། ཁ་ཅིག་ནི་བཟོད་པའི་ས་ལ་འགོད། ཁ་ཅིག་ནི་མཐོང་བའི་ས་ལ། ཁ་ཅིག་ནི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་འགོད་པར་བྱེད་དོ།
en: As they explain and teach by means of the Dharma, which is beyond worldly goods, they establish some people in the state of a worthy one, some in the fruition of a non-returner, some in the fruition of a once-returner, some in the fruition of a stream enterer, some on the level of forbearance, some on the level of seeing, and some on the path of the ten virtuous actions. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་ཇི་ལྟར་རྒྱལ་པོའི་བུ་དེ་གང་གི་ཚེ། རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བ་ཐོབ་པར་གྱུར་པ་དེའི་ཚེ། སྟེན་པའི་མི་དེ་དག་ཅི་རིགས་པར་ལོངས་སྤྱོད་ལ་འགོད་པ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: Venerable Pūrṇa, just as a crown prince grants benefits to his supporters at the time when he is anointed to rule the kingdom, so bodhisattva great beings will grant others whatever they desire when they awaken to unsurpassed and perfect buddhahood.

source: སེམས་ཅན་རྣམས་ཇི་ལྟར་མོས་པ་བཞིན་དུ་འགོད་པར་བྱེད་དེ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན།
en: If bodhisattva great beings act in such an awakened manner, they will provide for others and, once they awaken to unsurpassed and perfect buddhahood, grant them everything they need.

source: སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ཞིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་སེམས་ཅན་རྣམས་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་འགོད་པར་བྱེད་དོ། །
en: In that case, bodhisattva great beings will be providing for others through their awakened activity and also provide for their livelihood after they awaken to unsurpassed and perfect buddhahood.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ཞིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བར་འགྱུར་ལ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བར་འགྱུར་རོ།
en: Even as they pass into nirvāṇa, they will provide for others. “

source: བསྙེན་བཀུར་བྱེད་ན། དེའི་ཚེ་རྒྱལ་པོ་དེས་ཟས་དང་གོས་ཀྱི་བགོ་སྐལ་བྱིན་ནས།
en: In return for that person’s services, the king will give him his fair share of food and clothing.

source: གང་གི་ཚེ་མི་དེས་རྒྱལ་པོ་དེ་ལ་ཤས་ཆེར་བསྟེན་པ་དེའི་ཚེ། རྒྱལ་པོ་དེ་མཉེས་ཤིང་དགྱེས་པར་གྱུར་ཏེ།
en: Whenever the servant offers exceptional service to the king, the king will be pleased and delighted.

source: དེ་ཐུགས་རངས་པར་གྱུར་ནས། གོས་དང་རྒྱན་བརྒྱ་སྟོང་དུ་མ་བསྐོན་ཏེ། ལོངས་སྤྱོད་ཀྱིས་རྒྱས་པར་བྱེད་དོ།
en: In his delight, he will adorn the servant with hundreds of thousands of fine fabrics and gemstones and shower him with enjoyments.

source: །ཚེ་དང་ལྡན་པ་གང་པོ། དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན། སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ལ་སྦྱིན་པས་ཕན་འདོགས་པར་བྱེད་ཅིང་།
en: Likewise, Venerable Pūrṇa, bodhisattva great beings who are striving for awakening and wish to awaken to unsurpassed and perfect buddhahood will benefit limitless beings with gifts.

source: དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་། ཟང་ཟིང་མེད་པའི་ཆོས་ཀྱི་སྦྱིན་པས་སེམས་ཅན་རྣམས་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ། འཁོར་བ་ལས་སྒྲོལ་བར་བྱེད་དོ། །
en: Even as they awaken to unsurpassed and perfect buddhahood, they will offer counsel and teachings to others by means of the gift of the Dharma, which is beyond worldly goods, thus freeing them from cyclic existence.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཇི་ལྟར་བཤད་པ་དེ་དེ་བཞིན་ཏེ།
en: Venerable Pūrṇa Maitrāyaṇīputra replied to Venerable Śāradvatīputra, “Venerable Śāradvatīputra, what you have said is true.

source: ཚེ་དང་ལྡན་པ་དཔེར་ན། མི་གང་དག་གསེར་གྱི་འབྱུང་ཁུང་དེའི་ཉེན་ཀོར་ན་གནས་པའི་སེམས་ཅན་རྣམས་ནི། གསེར་གྱི་འབྱུང་ཁུང་དེས་ནམས་ཀྱང་ཉེ་བར་མི་འཚོ་བར་མི་འགྱུར་ཏེ།
en: Venerable One, as another analogy, people may live right next to a large deposit of gold ore, yet the gold ore on its own does not provide them a livelihood.

source: གང་གི་ཚེ་གསར་དུ་བརྐོས་ཤིང་ཕྱུང་ནས་རིང་པོར་མ་ལོན་པ་དེའི་ཚེ་ཡང་། སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བར་འགྱུར་རོ།
en: It is only when it is mined that, before long, it can provide a livelihood to those people.

source: །གང་གི་ཚེ་ཤིན་ཏུ་དྲི་མ་མེད་པར་བྱས་ཤིང་ཤིན་ཏུ་སྦྱངས་ནས་སྙིང་པོར་བྱས་ཏེ་ཕྱུང་བ་དེའི་ཚེ་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: When it is purified and refined, the actual gold emerges, and then it can provide people with a livelihood.

source: །གང་གི་ཚེ་འབྱུང་ཁུང་དེ་ནས་བཏོན་ནས་བཞུས་ཏེ། དེ་ནས་སུམ་ཆའམ། བཞི་ཆ་གསེར་དུ་གྱུར་པ་དེའི་ཚེ་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: As the gold is mined and smelted, the gold that is produced can now sustain the community, even if it is only a third or a fourth of the original ore.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་། ནམས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་མ་ཡིན་པར་མི་འགྱུར་ཏེ།
en: Venerable Śāradvatīputra, in the same way, bodhisattva great beings are never unable to sustain others.

source: བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན་ཡང་ཉེ་བར་འཚོ་བ་ཡིན།
en: They provide for others as they practice for the sake of awakening.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པར་འདོད་པ་ན་ཡང་། སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན།
en: When they wish to dwell at the seat of awakening, they are providing beings with what they need.

source: བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན་ཡང་། སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན།
en: As bodhisattvas awaken to unsurpassed and perfect buddhahood, they are providing sustenance for others.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ཏེ།
en: Even as they pass into nirvāṇa, they sustain others.

source: རྒྱུ་འདི་དག་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ལ་མེད་དོ། །
en: Such capacities are lacking in the hearers and the solitary buddhas.

source: རྒྱུ་དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མཆོག་ཅེས་བྱ། གཙོ་བོ་དང་། ཕུལ་དང་། རབ་དང་། རབ་མཆོག་དང་། གྱ་ནོམ་པ་དང་། བླ་ན་མེད་པ་དང་། གོང་ན་མེད་པ་ཞེས་བྱའོ།
en: It is because of such abilities that the bodhisattva great beings are said to be supreme, foremost, superior, preeminent, sublime, unsurpassed, and unexcelled.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་དང་། ལྷག་པའི་བསམ་པ་རྫོགས་པ་དང་། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་རྣམས་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུས་ཇི་སྐད་བཤད་པ་བཞིན་དུ་ཟུང་ཤིག །ཆོངས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །
en: Then the Blessed One said to Venerable Ānanda, “Ānanda, please make sure you remember, retain, and understand the elder Śāradvatīputra’s instructions on the perfection of generosity, including how bodhisattva great beings don heavy armor, enter the Great Vehicle, perfect their noble intention, and give away all their possessions!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: After the Blessed One had said this, Venerable Śāradvatīputra, Venerable Pūrṇa Maitrāyaṇīputra, Venerable Ānanda, the hearers, and the entire world, including its gods, humans, asuras, and gandharvas, rejoiced and praised what the Blessed One had said.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ་དགུ་པ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྫོགས་སོ།། །།
en: This concludes the ninth chapter from “The Perfection of Generosity” as well as “The Perfection of Generosity” itself.

source: འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ།
en: The Blessed One was staying in the Jeta Grove, Anāthapiṇḍada’s park at Śrāvastī, along with a great saṅgha of 1,250 monks. All of the monks were worthy ones who had exhausted their defilements.

source: ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ།
en: They were without afflictions and self-controlled.

source: སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཅང་ཤེས་པ།
en: Their minds were liberated and their insight was liberated. They were of noble birth.

source: གླང་པོ་ཆེན་པོ།
en: They were great elephants.

source: བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ།
en: They had accomplished their tasks and completed their work.

source: ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ།
en: They had laid down their burden and reached their goal.

source: སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ། ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: They had destroyed the bondages of existence and, due to their perfect knowledge, their minds were liberated.

source: སེམས་ཐམས་ཅད་ལ་དབང་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་དང་།
en: They had obtained supreme perfection in mastering all mental states.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ། གཞན་ཡང་གཟི་བརྗིད་ཆེ་བའི། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས།
en: Also present there were bodhisattva great beings who had gathered from buddhafields in all the ten directions, as well as splendorous gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and others who attended on and served the Blessed One.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ཉིད་ལས་བརྩམས་ནས་འཁོར་བཞི་པོ་དག་ལ་ཆོས་སྟོན་ཏོ།
en: At that time, the Blessed One taught the Dharma to the four assemblies on the topic of the six perfections.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་རྣམས་ཀྱི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བརྩམས་ཏེ། ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །
en: The Blessed One said to Venerable Śāradvatīputra, “Śāradvatīputra, please give a teaching on the perfection of discipline of those bodhisattva great beings who wish to awaken to unsurpassed and perfect buddhahood.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལས་སྐབས་ཕྱེ་བ་ཐོབ་ནས། སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ཏོ།
en: Thus, through the power of the Buddha and because the Blessed One had encouraged him to do so, Śāradvatīputra began to teach the bodhisattva great beings’ perfection of discipline.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་དང་ལྡན་པར་རིག་པར་བྱ།
en: At that point, Venerable Pūrṇa Maitrāyaṇīputra asked Venerable Śāradvatīputra, “Venerable Śāradvatīputra, how can we identify those bodhisattvas who have genuine discipline?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་འཆལ་པར་རིག་པར་བྱ།
en: How can we identify bodhisattvas with faulty discipline?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ནི་གང་ཡིན།
en: What is the domain of bodhisattvas?

source: སྤྱོད་ཡུལ་མ་ཡིན་པ་ནི་གང་ཡིན།
en: And what is not the domain of bodhisattvas?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གང་པོ་འདི་ལ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་རྣམས་ཀྱི་གནས་ན། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་མ་ཡིན་པའོ།
en: Venerable Śāradvatīputra said to Venerable Pūrṇa Maitrāyaṇīputra, “Venerable Pūrṇa, if bodhisattvas are involved with any attitudes of the hearers or solitary buddhas, that is not the domain of bodhisattvas.

source: །དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚུལ་ཁྲིམས་འཆལ་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་སྤྱོད་པའོ།
en: Any bodhisattvas who have such involvement are bodhisattvas with a lapse in discipline; they are involved in that which is not the domain of bodhisattvas.

source: །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་མི་འཛིན་པའོ།
en: They are not upholding the bodhisattvas’ perfection of discipline.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་མི་འཛིན་ན། བྱང་ཆུབ་སེམས་དཔའི་དམ་བཅས་པ་སྤོང་ངོ་།
en: Since they are not upholding the perfection of discipline, they have broken their bodhisattva commitment.

source: །བྱང་ཆུབ་སེམས་དཔའི་དམ་བཅས་པ་སྤོང་ན། ཚུལ་ཁྲིམས་འཆལ་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Since they have broken their bodhisattva commitment, they have a lapse in discipline.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་སྦྱིན་པ་ན། ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་སྔོ་ན། སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་སྤྱོད་དོ།
en: Venerable Pūrṇa, moreover, if bodhisattvas practice generosity and dedicate the merit toward the levels of the hearers or solitary buddhas, they are engaging in an improper domain.

source: །སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་སྤྱོད་ན། དེ་ཙམ་གྱིས་ན་ཚུལ་ཁྲིམས་འཆལ་པར་རིག་པར་བྱའོ།
en: Engaging in an improper domain in itself is a lapse in discipline.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་ན་གནས་ཤིང་། འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་ལོངས་སྤྱོད་པ་ཙམ་གྱིས་ནི། དེ་ཚུལ་ཁྲིམས་འཆལ་པར་རིག་པར་བྱ་བ་མ་ཡིན་གྱི།
en: If bodhisattvas live in a household and enjoy the five sense pleasures, that in itself is not a lapse in discipline.

source: གང་སྦྱིན་པ་སྦྱིན་ཞིང་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་སྔོ་ན། དེ་ཙམ་གྱིས་ན་ཚུལ་ཁྲིམས་འཆལ་པ་ཡིན་པར་རིག་པར་བྱའོ། །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན།
en: However, when they practice generosity and dedicate the merit toward the levels of the hearers or the solitary buddhas, that in itself is a lapse in discipline. “

source: རྒྱལ་པོའི་བུ་རྒྱལ་པོས་གདམས་པའི་ཚིག་བཞིན་དུ་བྱེད་པ་ཞིག་ཡོད་ལ། རྒྱལ་རིགས་རྣམས་ཀྱི་རྒྱལ་པོའི་བུས་བསླབ་པར་བྱ་བ་བཟོའི་གནས། འདི་ལྟར་གླང་པོ་ཆེའི་གཉའ་བར་བཞོན་པའམ། རྟ་བཞོན་པའམ། ཤིང་རྟ་བཞོན་པའམ། རལ་གྲིའི་ཐབས་སམ། འཕོང་ངམ། མདའ་བོ་ཆེ་འཕང་བའི་ཐབས་སམ། བརྒྱུག་པའམ། འགོམ་པའམ། འཆོང་བའམ། སྟོབས་འགྱེད་པའམ།
en: Venerable Pūrṇa, as an analogy, a prince who pays heed to the king’s advice will undertake all the trainings that are fitting for a royal prince, such as elephant riding, horse riding, chariot driving, swordsmanship, archery, javelin toss, running, marching, jumping, wrestling, and combat.

source: དགྲ་ཐབས་སམ། དེ་ལ་སོགས་པའི་བཟོ་དེ་དག་ལ་སློབ་ན། རྒྱལ་པོ་ལ་དབེན་པ་ཡིན་ཏེ། རྒྱལ་པོ་ཡང་སྨ་དབབ་པར་མི་སེམས་སོ།
en: While he trains in this way, although he is away from the king, he is also not dishonoring the king. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་ན་གནས་ཏེ། འདོད་པའི་ཡོན་ཏན་ལྔ་རྣམས་ཀྱིས་རྩེ་ཞིང་དགའ་ལ།
en: Venerable Pūrṇa, likewise, bodhisattvas may live as householders, enjoying the five sense pleasures.

source: དགའ་དགུར་སྤྱོད་དུ་ཟིན་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཕན་འདོགས་པ་ཉིད་དུ་གྱུར་པ་ཡིན་ནོ།
en: Although their lifestyle is to delight in pleasures in this way, it is still assisting the bodhisattvas toward the attainment of omniscience.

source: །གལ་ཏེ་ཡང་སྦྱིན་པ་སྦྱིན་པ་ན་ཉན་ཐོས་སམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་སྔོ་ན། དེ་ཙམ་གྱིས་ན་སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་སྤྱོད་པ་ཡིན་ཏེ། བདག་ཉིད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཞིང་དུ་མི་རུང་བར་བྱེད་དོ།
en: However, if they dedicate the merit of generosity toward attaining the levels of the hearers or the solitary buddhas, that in itself is an incorrect attitude that renders them unsuitable to attain omniscience.

source: །ཇི་ལྟ་ཇི་ལྟར་བདག་ཉིད་ཞིང་དུ་མི་རུང་བར་བྱེད་པ་དེ་ལྟ་དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་མི་འཛིན་ཏོ།
en: The more unsuitable they render themselves, the more incapable they will be of upholding the perfection of discipline.

source: །ཇི་ལྟ་ཇི་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་མི་འཛིན་པ་དེ་ལྟ་དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རིང་དུ་བྱེད་དེ།
en: The more incapable they are of upholding the perfection of discipline, the more removed from omniscience they will be.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: In that way they will not engage in the domain of bodhisattvas.

source: །དེའི་སྤྱོད་ཡུལ་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ཉིད་ནི། དེའི་ཚུལ་ཁྲིམས་འཆལ་པ་ཡིན་ནོ།
en: Straying from the domain of the bodhisattvas in itself entails a lapse in the bodhisattvas’ discipline. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གལ་ཏེ་ཁྱིམ་གྱི་གནས་ནས་བྱུང་བར་གྱུར་ཏེ།
en: Venerable Pūrṇa, moreover, bodhisattvas may go forth from home and keep pure discipline.

source: དེ་ཡང་ཚུལ་ཁྲིམས་གང་དང་གང་ཡང་དག་པར་བཟུང་ནས་གནས་པ་དེ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་མི་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་དང་ལྡན་པ་མ་ཡིན་ནོ།
en: However, unless they dedicate the merit toward omniscience, those bodhisattvas will not possess the discipline of bodhisattvas.

source: །གང་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་དང་མི་ལྡན་པ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱའོ།
en: Whoever lacks the discipline of bodhisattvas cannot be called a bodhisattva.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་ན་གནས་ཤིང་། གསུམ་ལ་སྐྱབས་སུ་སོང་བར་གྱུར་ལ། དེ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན།
en: Bodhisattvas may live as householders, taking refuge in the Three Jewels and dedicating the merit toward omniscience.

source: དེ་འདོད་པ་ལྔའི་ཡོན་ཏན་རྣམས་ལ་ལོངས་སྤྱོད་དུ་ཟིན་ཀྱང་། དེ་ཙམ་གྱིས་ན་དེ་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ལ་གནས་པ། ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: This in itself means they are keeping the discipline of bodhisattvas and should be known as disciplined, even though they may be enjoying the five sense pleasures.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ལ་གནས་པ་དེ་ནི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བ་ཡིན་ནོ།
en: Bodhisattvas who keep the discipline of bodhisattvas are never apart from the perfection of discipline.

source: །གང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མ་བྲལ་བ་ཞེས་བྱའོ།
en: Whoever does not part from the perfection of discipline should also be understood to be inseparable from omniscience.

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་འདོད་པ་དང་ལྡན་པའི་ཚུལ་བཞིན་མ་ཡིན་པའི་ཡིད་ལ་བྱེད་པ་རྣམས་འབྱུང་དུ་ཟིན་ཀྱང་། དེ་དག་ཐམས་ཅད་དེའི་ཐམས་ཅད་མཁྱེན་པ་ཡིད་ལ་བྱེད་པའི་སེམས་གཅིག་གིས་ཟིལ་གྱིས་གནོན་པར་འགྱུར་རོ།
en: Moreover, even if those bodhisattvas were to have improper and desirous thoughts, they would all be overcome through a single contemplation of omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་ནི། མཆིང་བུའི་ནོར་བུ་འབུམ་དག་དང་ལྷན་ཅིག་ཏུ་བསྲེས་ཏེ་བཞག་ན། ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱའི་རིན་ཐང་མེད་པ་དང་། ཁ་དོག་བཟང་པོ་དང་འོད་ཀྱིས་མཆིང་བུའི་ནོར་བུ་དེ་དག་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ།
en: Venerable Pūrṇa, moreover, if you take a beryl gemstone and place it among a hundred thousand semiprecious stones, the uniqueness, brilliance, and luster of the beryl will outshine all those semiprecious stones.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་དང་ལྡན་པའི་སེམས་གཅིག་བསྐྱེད་པས་ཟིལ་གྱིས་གནོན་པར་རིག་པར་བྱ་སྟེ། ཇི་ལྟར་མཆིང་བུའི་ནོར་བུ་དེ་དག་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་གཅིག་གིས་ཟིལ་གྱིས་ནོན་ཅིང་ལམ་མེར་མ་གྱུར་པ་བཞིན་ནོ།
en: Venerable Pūrṇa, likewise, you should know that all improper thoughts of a bodhisattva are eclipsed by a single contemplation of the roots of virtue of omniscience, just as beryl eclipses semiprecious stones and makes them look dull.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་མཚན་རྣམས་འདོད་ཅིང་སྦྱིན་པ་སྦྱིན་ན། སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་སྤྱོད་པའོ།
en: Venerable Pūrṇa, moreover, if bodhisattvas are generous simply because of wishing for special marks, they are engaging in an improper domain.

source: །གང་དེའི་སྤྱོད་ཡུལ་མ་ཡིན་པ་ཐམས་ཅད་ནི་འཆལ་པའི་ཚུལ་ཁྲིམས་ཡིན་པར་རིག་པར་བྱའོ།
en: In fact, all such cases of engaging in an improper domain constitute a lapse in discipline.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔས་མཚན་རྣམས་འདོད་པས་སྦྱིན་པ་སྦྱིན་པར་མི་བྱའི།
en: Venerable Pūrṇa, bodhisattvas should not practice generosity out of a desire for special marks.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་འདོད་པས་སྦྱིན་པ་སྦྱིན་པར་བྱའོ།
en: Instead, they should be generous because of wishing for omniscience.

source: གང་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོད་པ་དེ་ལ་ནི་མཚན་རྣམས་ཡོད་དོ།
en: Because whoever is omniscient will also have the marks.

source: །དེ་ལ་ནི་མི་འཇིགས་པ་རྣམས་ཡོད་དོ།
en: They will also have the types of fearlessness.

source: །དེ་ལ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་རྣམས་ཡོད་པ་ནས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་ཡོད་དེ།
en: They will also have the eighteen unique features of a buddha and all the other qualities of a buddha.

source: དེ་ལྟར་ན་དེའི་སྦྱིན་པ་ནི་མཆོག་ཏུ་བཟུང་བ་མ་ཡིན་ནོ།
en: Therefore, they should not think of generosity as being supreme in itself.

source: །གང་གི་ཚེ་མཆོག་ཏུ་མ་བཟུང་བ་དེའི་ཚེ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is when they do not think of generosity as being supreme that they master the perfection of discipline.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འདོད་པས་སྦྱིན་པ་སྦྱིན་པར་བྱེད་ན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མཆོག་ཏུ་འཛིན་པ་མ་ཡིན་ནམ།
en: Venerable Pūrṇa said, “Venerable Śāradvatīputra, when bodhisattvas who wish for omniscience practice generosity, do they not view omniscience as being supreme?

source: གང་དང་གང་ལ་མཆོག་ཏུ་འཛིན་པ་དེ་ཉིད་དེའི་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་མཆོག་ཏུ་འཛིན་པ་ཡིན་ནོ།
en: When something is viewed as supreme, the discipline and practice related to that are also viewed as supreme.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འདི་ནི་ཡུལ་ན་གནས་པའམ། ཕྱོགས་ན་གནས་པ་མ་ཡིན་ནོ། །
en: Venerable Śāradvatīputra said, “Venerable Pūrṇa, omniscience does not remain anywhere, nor is it found in a particular place.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི། གཟུགས་སམ། ཚོར་བའམ། འདུ་ཤེས་སམ། འདུ་བྱེད་རྣམས་སམ། རྣམ་པར་ཤེས་པ་ཡང་མ་ཡིན་ནོ།
en: Omniscience does not exist within form, feeling, perception, formation, or consciousness.

source: །འདུ་བྱས་ཀྱང་མ་ཡིན། འདུ་མ་བྱས་པ་ཡང་མ་ཡིན།
en: It is not compounded, nor is it uncompounded.

source: ཚད་ཡོད་པ་ཡང་མ་ཡིན་ཏེ།
en: It cannot be measured.

source: དེ་ནི་མཆོག་ཏུ་བཟུང་བར་མི་ནུས་སོ།
en: It is therefore impossible to apprehend it as supreme.

source: །ཆོས་གང་ཡང་དམིགས་སུ་མེད་དེ།
en: Omniscience does not take anything as a reference point.

source: གང་དམིགས་སུ་མེད་པ་དེ་ནི་ཡོད་པའང་མ་ཡིན། མེད་པའང་མ་ཡིན་ཏེ།
en: Whatever is beyond reference point does not exist, nor is it absent.

source: གང་ཡོད་པའང་མ་ཡིན། མེད་པའང་མ་ཡིན་པ་ནི་མཆོག་ཏུ་གཟུང་བར་མི་ནུས་སོ།
en: That which neither exists, nor is absent, cannot be viewed as being supreme.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་སྦྱིན་ནམ། ཚུལ་ཁྲིམས་སྲུང་ཞིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། ཚུལ་ཁྲིམས་དང་། བརྟུལ་ཞུགས་མཆོག་ཏུ་འཛིན་པ་མ་ཡིན་ནོ།
en: Therefore, Venerable Pūrṇa, when bodhisattva great beings dedicate their practice of generosity and their observance of discipline toward omniscience, it is not the case that they view their discipline and practice as supreme.

source: །གལ་ཏེ་ཡང་ཚུལ་ཁྲིམས་དེ་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་སྔོ་ན། ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པ་ཡིན་ཏེ།
en: If, however, they were to dedicate the merit toward the levels of the hearers or the solitary buddhas, they would be assuming their discipline to be supreme.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ལས་ཉམས་པ་ཡིན་ནོ། །
en: That would entail the bodhisattvas having damaged their bodhisattva discipline.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་ཉམས་པ་ཕྱིར་བསླང་བར་ནུས་སམ།
en: Venerable Pūrṇa asked, “Venerable Śāradvatīputra, are bodhisattvas able to repair such damages?”
